import pandas as pd
import re

placeholder = ["哪些","哪个","哪年","哪里","哪所","哪一年","哪种","哪一个",\
               "是谁","谁是","是什么","是多少","是哪",\
               "什么时候","叫什么","于什么","什么",
               "何时",\
               "怎么样",\
               "由谁",\
               "有怎样的","有多","有什么","多少",\
               "为","在","哪","是","有","的"]
# 占位符是有先后次序的
#placeholder = ["哪些","哪个","是谁","是什么","是多少"]
# 取消 stop word = ["多少","是什么","是谁的","是谁","何时","什么","哪个","个时","中的","有什么","有哪些","哪里","那些","《","》",'"q60"']
# 使用stop_ord在CNN相似度上可能有点用
# baike 也加入了实体停用词 然后 关掉了 汉语词汇 的 if 扩充了 entity_stop
stop_words = []
entity_stop = ["多少","是什么","是谁的","是谁","何时","什么","哪个","个时","中的","有什么","有哪些","哪里","那些","《","》",'"q60"',\
                '告诉我','那位', '那里','请问','请推荐','向我推荐','请列举','列举','生活中','请给出', '给出','请列出', '列出','你知道',\
                '我想','给我一些', '给我', '现在都有','我想看','你们', '我们', '它们', '他们','我国','你', '我', '它', '他','共同',\
                '做出了','应该','如果','会在','一共','总共','从','看上去','归类为','记得','一员','历史上','听说',\
                "多少","是什么","是谁的","是谁","何时","什么","哪个","个时","中的","有什么","有哪些",\
                "哪里","那里","大学","作者","毕业","来自","电影","的","你读过","你知道","游戏",\
                "站点","网站","就是",'时候','生人','那个',"在哪","国家",'以及', '各自',"了","大","他的",\
                "家的","知道","国家的","我们","你们","民族","有","出","著",\
                "它","是"]#作家
               
with open("task4coqa_train.txt","r",encoding="utf8") as f:
    qa = f.read()
qa_pair = re.split("\n\n",qa)
ans = []
for row in qa_pair[:-1]:
    question,sparql,answer=row.split("\n")
    
    #删除两侧的多余空格
    answer = answer.strip()
    
    #答案有时会少了引号,导致和数据库对不上,我们手动加
    
    if answer[0]!="<" and answer[0]!='"':
        answer = '"'+answer+'"'
    
    question = re.sub("(q\d{1,4}:|？)","",question)
    
    ans.append((question,sparql,answer))
df = pd.DataFrame(ans,columns=["question","sparql","answer"])